## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.ecs_warn_error_event will be created
  + resource "aws_cloudwatch_log_metric_filter" "ecs_warn_error_event" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ecs_events"
      + name           = "MetricEcsWarnErrorEvent"
      + pattern        = "?Warn ?Error"

      + metric_transformation {
          + default_value = "0"
          + name          = "EcsWarnErrorEvent"
          + namespace     = "CovidShieldMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.ecs_warn_error_event will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_warn_error_event" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_description                     = "Metrics ECS warning or error event detected"
      + alarm_name                            = "MetricEcsWarnErrorEvent"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MetricEcsWarnErrorEvent"
      + namespace                             = "CovidShieldMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          + propagate_tags          = "TASK_DEFINITION"
            tags                    = {}
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>